Table of Contents
 Class LoadInPoint
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Concentrated load
[OpenModelClass("CI.StructModel.Loading.LoadInPoint,CI.Loading", "CI.StructModel.Loading.ILoadInPoint,CI.BasicTypes")]
public class LoadInPoint : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LoadInPoint
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Examples
This sample shows how to create a load in the point.
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Point loading impulse in the node - int rthe LCS of node = GCS
LoadInPoint loadPoint = new LoadInPoint();
loadPoint.Geometry = new ReferenceElement(pointB);
loadPoint.Fx = -5e3; //in the global X direction
openModel.AddObject(loadPoint);
loadCase.LoadsInPoint.Add(new ReferenceElement(loadPoint));
Constructors
 LoadInPoint()
Constructor
public LoadInPoint()
Properties
 Direction
Local / global
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 Fx
Force in X direction
public double Fx { get; set; }
Property Value
double
 Fy
Force in Y direction
public double Fy { get; set; }
Property Value
double
 Fz
Force in Z direction
public double Fz { get; set; }
Property Value
double
 Geometry
Gets, sets geometry
public ReferenceElement Geometry { get; set; }
Property Value
ReferenceElement
 Mx
Moment about the x-axis
public double Mx { get; set; }
Property Value
double
 My
Moment about the y-axis
public double My { get; set; }
Property Value
double
 Mz
Moment about the z-axis
public double Mz { get; set; }
Property Value
double
 Edit this page